Tekla Open API Reference for Tekla Structures 2025
RebarThreadingDataNullable Properties
The RebarThreadingDataNullable type exposes the following members.
Properties
Name | Description
ExtraFabricationLength
 Gets or sets the extra fabrication length.
Length
 Gets or sets the threading length.
ThreadingType
 Gets or sets the threading type. Null indicates that the threading type is not specified.
Top
See Also
Reference
RebarThreadingDataNullable Class
Tekla.Structures.Model Namespace